
# номер1 Дана строка. Подсчитать самую длинную последовательность подряд идущих букв «н». Преобразовать её,заменив точками все восклицательные знаки
b=input('введите строку ')
b+=' '
a=0
n=0
for i in range(len(b)):
    if b[i]=='н':
        n+=1
    elif n>a:
        a=n
        n=0
c=b.replace('!','.')
print(c)
print(a)

#номер2 Дана строка символов, среди которых есть одна открывающаяся и одна закрывающаяся скобки. Вывести на экран все символы,
#расположенные внутри этих скобок.

n=input('введите строку ')
l=(n.index('(')+1)
m=n.index(')')
c=n[l:m]
print(c)

#номер3 Дана строка. Вывести все слова, начинающиеся на букву "а" и слова оканчивающиеся на букву "я". Например: Абстракция, авария, аллея.
d=input('введите сторку ')
for i in d.split(' '):
    if(i.startswith('а')) or (i.endswith('я')):
        print(i)
